Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཁྲོ་བོའི་རྒྱལ་པོ་ཆེན་པོས་བཀའ་མཉན་ནསཁྲོ་བོ་ཆེན་པོའི་གཟུགས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་བསྲུང་བ་དང་རྗེས་སུ་བསྟན་པའི་ཕྱིར་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་ཁྲོ་བོའི་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཕྱོགས་བཞི་ཀུན་དང་སྟེང་དང་འོག་དང་ཐད་ཀ་དག་ཏུ་ཤིན་ཏུ་མི་བཟད་པའི་སྒྲ་རབ་ཏུ་འདོན་ཅིང་གནས་པར་གྱུར་ཏོ། །
en: Thus addressed, the Great Lord of Wrath, of extremely ugly, misshapen appearance, acknowledged the command and went outside in order to protect all the beings and to train the assembled audience in every respect. Letting out a terrible roar into the four directions, above, below, and across, he took up his position in the form of Yamāntaka Lord of Wrath , with a retinue of many hundreds of thousands of wrathful deities.

source: དེ་ནས་སེམས་ཅན་དེ་དག་ཞི་བ་དང་ཡིད་དང་སེམས་བཟང་པོ་དང་ལྡན་པར་གྱུར་ཏེ་བཀའ་ལས་མི་འདའ་བར་བྱེད་པར་གྱུར་ཏོ། །
en: Thus all beings, having become peaceful and content, did not transgress his orders.

source: འདི་ལྟ་བུའི་སྒྲ་ཡང་ཐོས་པར་གྱུར་ཏེ།
en: They also heard these words:

source: གང་དམ་ཚིག་འདི་ལས་འདའ་བར་བྱེད་པ་དེ་དག་ནི་ཨ་རྫ་ཀའི་དོག་པ་བཞིན་དུ་མགོ་ཚལ་པ་བརྒྱར་འགས་པར་འགྱུར་ཏེ།
en: “Those who would disobey this injunction, their heads will split into one hundred parts like a garland made of basil plants.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་ཀྱང་དེ་ཡིན་ནོ། །
en: For such is the power of the bodhisattvic blessing. {1.110}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་རང་གི་སྔགས་ཀྱི་སྤྱོད་པའི་དོན་དུ་ཆོས་ཀྱི་ཚིག་སྨྲས་པ།
en: Mañjuśrī then gave a Dharma teaching on the practice of his mantra.

source: ཆོས་གཅིག་ལ་ཡང་དག་པར་བསམས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྔགས་འགྲུབ་པར་འགྱུར་ཏེ
en: “When a bodhisattva, a great being, possesses a single quality, his mantras become effective.

source: གཅིག་པོ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What is this single quality?

source: ཆོས་ཐམས་ཅད་སྤྲོས་པ་མེད་པའི་རྣམ་པར་རྗེས་སུ་མཐོང་བའོ། །
en: It is the mind that beholds all phenomena without mentally elaborating upon them. {1.111}

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཉིས་ལ་རབ་ཏུ་གནས་ན་སྔགས་འགྲུབ་པར་འགྱུར་ཏེ།
en: “When a bodhisattva, a great being, possesses two qualities, his mantras become effective.

source: གཉིས་པོ་གང་ཞེ་ན་
en: What are these two?

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པའོ། །
en: They are (1) never abandoning bodhicitta, and (2) having equanimity toward all sentient beings. {1.112}

source: ཆོས་གསུམ་དང་ལྡན་ན་སྔགས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “With three qualities, his exposition of the meaning of mantra practice will be perfect.

source: གསུམ་པོ་གང་ཞེ་ན།
en: What are these three?

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་ཉིད་དང་།
en: (1) never abandoning any sentient being,

source: བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་སྡོམ་པ་སྲུང་བ་དང་།
en: (2) guarding the vows of the bodhisattva’s discipline, and

source: རང་གི་སྔགས་ཡོངས་སུ་མི་གཏོང་བ་ཉིད་དོ། །
en: (3) never abandoning his mantra. {1.113}

source: ཆོས་བཞི་དང་ཡང་དག་པར་ལྡན་ན་དང་པོ་སེམས་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྔགས་འགྲུབ་པར་འགྱུར་ཏེ།
en: “When a bodhisattva, who has made the initial resolution of a bodhisattva, possesses four qualities, his mantras become effective.

source: བཞི་པོ་གང་ཞེ་ན།
en: What are these four?

source: རང་གི་སྔགས་ཡོངས་སུ་མི་གཏོང་བ་ཉིད་དང་།
en: (1) never abandoning his mantra,

source: གཞན་གྱི་སྔགས་རྗེས་སུ་སྤྱོད་པ་མེད་པ་ཉིད་དང་།
en: (2) not neutralizing the mantras of others,

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་གནས་པ་ཉིད་དང་།
en: (3) generating loving kindness for all sentient beings, and

source: སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བསྒོས་པའི་སེམས་པ་ཉིད་དོ། །
en: (4) suffusing his mindstream with compassion.

source: ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་དང་པོ་སེམས་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྔགས་འགྲུབ་པར་འགྱུར་རོ། །
en: The mantras of a bodhisattva who has made an initial resolution and possesses these four qualities become effective. {1.114}

source: ཆོས་ལྔ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་འཇུག་ཅིང་སྔགས་ཀྱི་སྤྱོད་པ་སྒྲུབ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Five qualities will bring the bodhisattva’s mastery of his mantra practice and his engagement in the basket of teachings to perfection .

source: ལྔ་པོ་གང་ཞེ་ན།
en: What are these five?

source: རྣམ་པར་དབེན་པའི་ཕྱོགས་ཡང་དག་པར་བསྟེན་པ་ཉིད་དང་། །
en: (1) frequenting solitary places,

source: བས་མཐའ་དགོན་པ་སྟེན་པར་བྱེད་པ་ཉིད་དང་།
en: (2) frequenting remote, peaceful places,

source: སེམས་ཅན་གཞན་ལ་ཞེ་སྡང་མེད་པ་ཉིད་དང་།
en: (3) not hating others,

source: འཇིག་རྟེན་པའི་སྔགས་ལ་མི་ལྟ་བ་ཉིད་དང་།
en: (4) not considering employing mundane mantras, and

source: ཚུལ་ཁྲིམས་དང་ཐོས་པ་དང་སྤྱོད་པ་ལ་གནས་པར་བྱེད་པ་ཉིད་དེ་ཆོས་ལྔ་པོ་འདི་དག་དང་ལྡན་ན་སྔགས་སྤྱོད་པའི་དོན་འགྲུབ་ཅིང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: (5) establishing others in discipline, learning, and good character. These five qualities will completely fulfill the purpose of his mantra practice. {1.115}

source: ཆོས་དྲུག་དང་ལྡན་ན་སྔགས་ཀྱི་སྤྱོད་པ་འགྲུབ་ཅིང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Six qualities will completely fulfill the purpose of mantra practice.

source: དྲུག་པོ་གང་ཞེ་ན།
en: What are these six?

source: དཀོན་མཆོག་གསུམ་ལ་དད་པ་རྗེས་སུ་མི་གཅོད་པ་ཉིད་དང་།
en: (1) not giving up faith in the Three Jewels,

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་དང་བ་རྗེས་སུ་མི་གཅོད་པ་ཉིད་དང་།
en: (2) not giving up faith in the bodhisattvas,

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྔགས་ལ་ཀུན་དུ་དགའ་བ་ཉིད་དང་།
en: (3) praising both mundane and supramundane mantras,

source: ཆོས་ཀྱི་དབྱིངས་སྤྲོས་པ་མེད་པ་ལ་ལྟ་བ་ཉིད་དང་།
en: (4) perceiving the sphere of phenomena that is free of elaboration,

source: ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ཟབ་མོའི་ཚིག་གི་དོན་མི་སྤོང་ཞིང་སྐྱོ་བ་མེད་པའི་སེམས་ཉིད་དང་།
en: (5) not rejecting the sūtras of the Great Vehicle that contain profound words and meaning, (6) never losing heart,

source: སྔགས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་བཙལ་བ་དང་།
en: (7) pursuing the mantra practice, and

source: དགེ་བའི་ཕྱོགས་ཡོངས་སུ་མི་གཏོང་བ་ཉིད་དེ།
en: (8) not letting virtue decline.

source: ཆོས་དྲུག་པོ་འདི་དག་དང་ལྡན་ན་རིག་པའི་སྤྱོད་པ་དང་སྔགས་འགྲུབ་ཅིང་ཡང་དག་པར་སྒྲུབ་པ་ཉིད་དུ་འགྱུར་རོ། །
en: These six qualities will bring complete success in the practice of mantra and the knowledge of vidyā s. {1.116}

source: ཆོས་བདུན་དང་ལྡན་ན་རིག་པ་སྒྲུབ་པའི་དུས་ཀྱི་ཐབས་ཐོབ་པར་འགྱུར་ཞིང་། སྔགས་ཀྱི་སྤྱོད་པ་ལ་རྗེས་སུ་སྤྱོད་པ་ཉིད་དུ་འགྱུར་ཏེ།
en: “There are seven qualities that lead to the taking up of mantra practice that are helpful at the time of the actual application of magical vidyā s.

source: བདུན་པོ་གང་ཞེ་ན།
en: What are these seven?

source: ཐེག་པ་ཟབ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་སྒོམ་པ་དང་།
en: They are (1) taking up the profound path by cultivating the perfection of wisdom;

source: ཀློག་པ་དང་། སྟོན་པ་དང་། འདོན་དུ་འཇུག་པ་དང་། འདྲི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་མོས་པ་ཉིད་དང་།
en: (2) resolving upon the bodhisattva conduct that consists in reciting, teaching, studying, and writing;

source: དུས་དང་། ཕྱོགས་དང་། ངེས་པར་སྡོམ་པ་དང་། བཟླས་པ་དང་། སྦྱིན་སྲེག་དང་། མི་སྨྲ་བ་དང་། དཀའ་ཐུབ་ལ་གཞོལ་བ་ཉིད་དང་། རྟོགས་པ་དང་། བློ་དང་། དྲན་པ་དང་། ཤེས་རབ་དང་། བསྟན་པ་ལ་བསྙེན་པ་ཉིད་དང་།
en: (3) taking up the right demeanor, thoughts, recollections, and the holding on to insight, without being impeded by time, place, ritual injunctions, mantra recitation, homa offerings, vows of silence, or the practice of austerities;

source: བྱང་ཆུབ་ཀྱི་ཚོགས་དང་། ཐེག་པ་ཆེན་པོ་དང་ཟབ་པའི་ཆོས་ཀྱི་ཚུལ་ལ་ཡང་དག་པར་རབ་ཏུ་ཞུགས་པ་ཉིད་དང་
en: (4) entering the way of the deep teachings of the Great Vehicle through the two accumulations of a bodhisattva;

source: རང་དགའི་སྔགས་དགུག་པའི་བྱ་བ་ལ་མཁས་པ་ཉིད་དང་།
en: (5) skill in the procedures of summoning the mantra deities of one’s own lineage

source: སྙིང་རྗེ་ཆེན་པོ་དང་། བྱམས་པ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་ཉིད་ཡོངས་སུ་བསྒོམ་པ་ཉིད་དང་
en: (6) cultivating great compassion, great loving kindness, great equanimity, and great sympathetic joy,

source: སྤྲོས་པ་མེད་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དེ་བཞིན་ཉིད་ལ་འཇུག་པ་གཉིས་སུ་མེད་པའི་ངོ་བོའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་བ་ཉིད་དང་།
en: (7) pursuing the two types of omniscient wisdom by bringing together the sphere of sentient beings, the sphere of phenomena, and ‘suchness’ through nonconceptuality;

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་ཉིད་དང་
en: (8) never abandoning any sentient being;

source: ཐེག་པ་དམན་པ་ལ་དགའ་བ་མེད་པ་ཉིད་དེ།
en: and (9) not seeking the Lesser Vehicle.

source: ཆོས་བདུན་པོ་དེ་དག་གིས་ནི་རིག་པ་དང་སྔགས་འགྲུབ་ཅིང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: These seven qualities lead to the perfect mastery of mantras and magical knowledge. {1.117}

source: ཆོས་བརྒྱད་དང་ལྡན་ན་རིག་པ་དང་སྔགས་ཀྱི་སྤྱོད་པའི་དོན་འགྲུབ་ཅིང་ལམ་དུ་འགྲོ་བར་འགྱུར་ཏེ།
en: “Eight qualities will completely fulfill the purpose of the practice of mantra and magical vidyā s.

source: བརྒྱད་པོ་གང་ཞེ་ན།
en: What are these eight?

source: མཐོང་བ་དང་མ་མཐོང་བའི་འབྲས་བུ་དག་ལ་བལྟ་བ་དང་སེམས་པར་འདོད་པ་ཉིད་དང་།
en: (1) faith in karmic results, both seen and unseen; (2) refraining from investigating anything out of mere curiosity or the desire to know;

source: བྱང་ཆུབ་སེམས་དཔའི་འབྲས་བུ་དང་བཅས་པའི་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ཉིད་ལ་ཐེ་ཚོམ་མེད་ཅིང་དང་བ་ཉིད་དང་།
en: (3) displaying magical powers made effective through the grace of a bodhisattva;

source: ཕྱིན་ཅི་མ་ལོག་པའི་སྔགས་གཟུང་བ་དང་བླ་མ་ལ་གུས་པ་ཉིད་དང་།
en: (4) out of respect for the teacher, learning from him the undistorted mantras;

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱི་སྔགས་དང་།
en: (5) taking to heart the master’s instructions on the buddhas and bodhisattvas’ own mantra system;

source: རྒྱུད་དང་སྤྱོད་པ་བསྟན་པ་མི་སླུ་བ་བཟུང་ཞིང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ཉིད་དང་།
en: (6) keeping one’s word; (7) renouncing all of one’s possessions;

source: སངས་རྒྱས་ཀྱི་ཞིང་གནས་དང་གནས་མ་ཡིན་པ་རྨི་ལམ་ན་མཐོང་བ་རབ་ཏུ་སྟོན་པ་ལ་མཁས་པ་ཉིད་དང་།
en: (8) being able to skillfully explain the signs received in one’s sleep about suitable and unsuitable places for gaining accomplishment;

source: སེར་སྣ་དང་གཉིད་དང་རྨུགས་པ་མཐའ་དག་དང་བྲལ་བར་བྱེད་ཅིང་རྟག་ཏུ་བརྩོན་འགྲུས་རྩོམ་ལ།
en: (9) freeing oneself from all stains of stinginess, sleepiness, and dullness, and constantly practicing diligence; and

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདག་ཉིད་འབུལ་བར་བྱེད་པ་ཉིད་དང་།
en: (11) always offering oneself to the buddhas and bodhisattvas.

source: མདོར་བསྡུ་ན་དགེ་བའི་རྩ་བས་ཆོག་མི་ཤེས་ཤིང་གོ་ཆ་ཆེན་པོ་བགོས་པ་དང་། བགེགས་ཐམས་ཅད་རབ་ཏུ་སེལ་བར་འདོད་པ་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་གནོན་པ་དང་ལོངས་སྤྱོད་ཆེན་པོ་དང་།
en: In short, never being complacent about accumulating the roots of virtue, donning great armor, or desiring to remove all obstacles, one will ascend the seat of awakening and experience great bliss as anticipated.

source: དབང་ཆེ་བར་གྲགས་པར་བདག་ཉིད་འདོད་པ་ཉིད་དང་དབང་ཆེ་བར་གྲགས་པའི་གང་ཟག་ལ་བསྙེན་པ་དང་དགེ་བའི་བཤེས་གཉེན་དང་མི་འབྲལ་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཉེ་བར་གནས་པ་ཉིད་དེ།
en: One will be known as a great being and will also fall in with other great beings. One will never be separated from a spiritual friend and will be accompanied by Mañjuśrī, the divine youth, the bodhisattva.

source: ཆོས་བརྒྱད་པོ་འདི་དག་དང་ལྡན་ན་སྔགས་སྤྱད་པའི་དོན་འགྲུབ་པའི་ཡང་དག་པའི་ལམ་དུ་འགྱུར་རོ། །
en: The aforementioned eight qualities will completely fulfill the purpose of mantra practice. {1.118}

source: གྲོགས་པོ་དག་མདོར་ན་
en: “Friends! To sum up,

source: བྱང་ཆུབ་ཀྱི་སེམས་དང་མི་འབྲལ་བ་དང་། དཀོན་མཆོག་གསུམ་ལ་དད་པ་དང་མཆོག་ཏུ་སྡུག་བསྔལ་ཞིང་ཚུལ་ཁྲིམས་ཉམས་པ་ལ་ཡང་མི་སྐྱོ་བའི་ཡིད་ཀྱིས་རྟག་ཏུ་མངོན་པར་བརྩོན་པ་ལ། ངའི་སྔགས་ཀྱི་ལེའུ་རབ་འབྱམ་མཐའ་ཡས་ཤིང་རྨད་དུ་བྱུང་བ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུ་མཐུན་པའི་ཡིད་ལས་བྱུང་བ་འགྲུབ་པར་འགྱུར་ཏེ་
en: a person who is not separated from bodhicitta, who is devoted to the Three Jewels, who continually exerts himself with unwearied mind even if he were of extremely bad disposition, will succeed in the infinite and marvelous mantra practice of a bodhisattva as taught in the detailed chapter on my mantra, and will develop the mind that arises from this practice.

source: དེ་ལས་གཞན་དུ་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: It should not be known to be otherwise.

source: རྣམ་པར་རྟོག་པ་མེད་པའི་ཡིད་དུ་བྱས་ནས་ཉམ་སད་པའི་ཕྱིར་ཡང་བསྒྲུབ་པར་བྱ་བ་ཡིན་ནོ། །
en: Once someone has become free from dualistic thinking, he will succeed even if his original motive was mere curiosity.” {1.119}

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་རང་སངས་རྒྱས་དང་འཕགས་པ་ཉན་ཐོས་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དག་གིས་འདི་སྐད་དུ་ཚིག་རྗོད་པར་བྱེད་དེ་
en: Then, the entire gathering, graced with the presence of buddhas, bodhisattvas, pratyeka­buddhas, and venerable śrāvakas, said these words: {1.120}

source: ཀྱེ་རྒྱལ་བའི་སྲས་ལེགས་སོ་ལེགས་སོ། །
en: “Good! It is good, O son of the victorious ones!

source: སྔགས་ཀྱི་སྤྱོད་པའི་དོན་རྣམ་པ་སྣ་ཚོགས་པའི་བྱ་བ་ཆོས་ཀྱི་ཚུལ་ལ་རྗེས་སུ་འཇུག་པ་དང་མཐུན་ཞིང་ཆོས་བསྟན་པ་ལེགས་པར་བསྟན་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་རོ། །
en: This Dharma discourse, which leads beings to enter an illustrious Dharma path whose special purpose is mantra practice, has been well presented for the benefit of all beings.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཆོས་རྣམ་པ་སྣ་ཚོགས་བསྟན་པ་དང་རྗེས་སུ་མཐུན་ཞིང་སྔགས་ཀྱི་སྤྱོད་པ་དང་རྗེས་སུ་མཐུན་པ་ལེགས་པར་བསྟན་པ་ཉིད་དོ། །
en: O divine youth Mañjuśrī, this talk that is in accord with mantra practice and complies with the requirements of a fine Dharma discourse has been eloquently presented.

source: རྒྱལ་པོ་ཆེན་པོ་གང་ལ་ལ་ཞིག་འདུས་པའི་ལེའུ་འདི་ཀློག་པར་འགྱུར་བ་དང་། འཛིན་པར་འགྱུར་བ་དང་། ཡིད་ལ་བྱེད་པར་འགྱུར་བའམ།
en: If any king has this chapter, which records the coming together of the audience, retold, or causes it to be memorized or reflected upon, or if,

source: གཡུལ་གྱི་ཐོག་མར་གླང་པོ་ཆེའི་སྟེང་དུ་བཞག་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པར་བྱེད་ནདེ་ལ་བདག་ཅག་བྱིན་གྱིས་རློབ་པར་བྱེད་ཅིང་ཕྱིར་རྒོལ་བ་དང་།
en: before a battle, he has it mounted on an elephant and worshiped with various flowers, incense, scents, and ointments, there we will also be present.

source: དགྲ་བོ་དག་ཀྱང་དབང་དུ་འགྱུར་ལ་གཞན་གྱི་དམག་གི་དཔུང་ཡང་གཞིག་པར་བགྱིའོ། །
en: We will bring his opponents and enemies under control, and we will destroy the armies that oppose him.

source: གླེགས་བམ་ལ་བྲིས་པ་བྱས་ཏེ་རང་གི་ཁྱིམ་ཏུ་བཞག་ན་དེ་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ་རྒྱལ་པོའམ་རྒྱལ་པོ་ཆེན་པོའམ་རྒྱལ་མོའམ་རྒྱལ་མོ་ཆེན་མོའམ། དགེ་སློང་ངམ་དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ་དགེ་བསྙེན་མ་དག་ལ་སྲུང་བ་ཆེན་པོ་དང་ལོངས་སྤྱོད་ཆེན་པོ་དང་ལྡན་པ་དང་། ཚེ་རིང་བ་ཉིད་དང་། ནད་མེད་པ་ཉིད་དང་། ལོངས་སྤྱོད་རྟག་ཏུ་མངོན་པར་འཕེལ་བ་ཉིད་ཀྱང་བགྱིའོ། །
en: Or, if anyone keeps it in their house written in the form of a book, we will grant to that son or daughter of the Buddha family—be they a king or a queen, a monk or a nun, or a male or female lay practitioner—protection, prosperity, long life, life free from disease, and the continuous increase of good fortune.” {1.121}

source: དེ་སྐད་ཅེས་སྨྲས་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཅང་མི་སྨྲ་བར་གྱུར་ཏོ། །
en: Having said this, the great assembly fell silent. {1.122}

source: ཐེག་པ་ཆེན་པོ་སྔགས་ཀྱི་སྤྱོད་པ་བསྟན་པའི་ཆོ་ག་ཞིབ་མོ་ཆེན་པོ་ལས། བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྣམ་པར་འཕྲུལ་པའི་ལེའུ་རབ་འབྱམ་རྩ་བའི་ཆོ་ག་ཞིབ་མོ་ལས་འདུས་པའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This concludes the first chapter, describing the coming together of the audience, from this great root manual containing an exposition of the mantra practices of the Great Vehicle, an extensive textbook that is a miraculous bodhisattva display of Mañjuśrī, the divine youth.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ལ་བལྟས་ནས། །
en: Now Mañjuśrī, the divine youth, gazing at this entire assembly,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དམ་ཚིག་ལ་རྗེས་སུ་འཇུག་ཅིང་ཀུན་དུ་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: entered the samādhi called the gaze that causes all sentient beings to take up the samaya pledge .

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྙོམས་པར་ཞུག་མ་ཐག་ཏུ་ལྟེ་བའི་དཀྱིལ་འཁོར་གྱི་ཕྱོགས་ནས་
en: As soon as Mañjuśrī, the divine youth, entered this samādhi, a ray of light issued from his navel.

source: འོད་ཟེར་བྱེ་བ་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དང་ལྡན་པའི་འོད་ཟེར་ཕྱུང་སྟེ།
en: Along with many hundreds of thousands of millions of other rays,

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀུན་དུ་སྣང་བར་བྱས་ནས་སླར་ལོག་སྟེ།
en: it entirely illuminated all the realms of sentient beings and,

source: གནས་གཙང་མའི་གཞལ་མེད་ཁང་སྣང་བར་བྱས་ནས་འཁོད་པར་གྱུར་ཏོ། །
en: reflecting back onto the realm of the Pure Abode, suffused it with light. {2.1}

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སྨྲས་པ།
en: Then the bodhisattva Vajrapāṇi, the great being, addressed Mañjuśrī, the divine youth:

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དམ་ཚིག་ལ་རྗེས་སུ་ཞུགས་པ་ཞེས་བྱ་བའི་དཀྱིལ་འཁོར་གྱི་ལེའུ་རབ་འབྱམ་གྱི་སྤྱོད་པ་སྒྲུབ་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐུན་མོང་དུ་གྱུར་པ། ཁྱོད་ཀྱི་སྔགས་ཀྱི་ཚོགས་གང་དུ་སེམས་ཅན་ཡང་དག་པར་ཞུགས་ན་
en: “Please teach, O son of the victorious ones, the full chapter on the maṇḍala called Establishing All Beings in the Samaya, which concerns the accomplishment of the practice that is common to all beings.

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་ཐམས་ཅད་ཀྱི་སྔགས་འགྲུབ་པ་ཡང་དག་པར་ཐོབ་པར་འགྱུར་བས། སེམས་དཔའ་ཆེན་པོ་ཁྱོད་སྨྲོས་ཤིག་སྨྲོས་ཤིག །
en: Having taken up this practice, beings will accomplish your collection of mantras, in addition to accomplishing all mundane and supramundane mantras.” {2.2}

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གསང་བ་པའི་བདག་པོ་གནོད་སྦྱིན་གྱི་བདག་པོ་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མཆོག་ཏུ་གསང་བའི་དཀྱིལ་འཁོར་གྱི་རྒྱུད་སྨྲས་སོ། །
en: Being thus requested by the lord of guhyakas and yakṣa s, Mañjuśrī, the divine youth, taught the most secret system of the maṇḍala.

source: རིག་པ་ཐམས་ཅད་ཡང་དག་པར་བསྐུལ་བ་ཞེས་བྱ་བའི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་སྟོན་པར་ཡང་བྱེད་དོ། །
en: He displayed the magical feat called impelling all the vidyā beings .

source: ལག་པ་གཡས་པ་བཏེག་ནས་སོར་མོའི་རྩེ་མོས་འཁོར་གྱི་དཀྱིལ་འཁོར་ལ་སྟོན་པར་བྱེད་དེ། སོར་མོའི་རྩེ་མོ་དེ་ལས་རིག་པའི་རྒྱལ་པོ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མ་བྱུང་སྟེ།
en: Raising his right hand, he drew the attention of the assembled congregation by using the tip of his finger, from which emerged many hundreds of thousands of millions of vidyādhara kings.

source: བྱུང་ནས་ཀྱང་གནས་གཙང་མའི་གནས་ཀྱི་གཞལ་མེད་ཁང་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་གནས་པར་གྱུར་ཏོ། །
en: Upon emerging, they illuminated the entire realm of the Pure Abode with great light and remained there. {2.3}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་ཀྱི་སྙིང་པོ་ལས་ཐམས་ཅད་བྱེད་པ་དང་། དཔའ་བོ་གཅིག་པ་སྤྱན་དྲང་བ་དང་གཤེགས་སུ་གསོལ་བ་དང་། ཞི་བ་དང་རྒྱས་པ་དང་། མངོན་སྤྱོད་དང་མི་སྣང་བ་དང་། ནམ་མཁའ་ལ་འགྲོ་བ་དང་། ས་འོག་ཏུ་འཇུག་པ་དང་། ཆུ་ལ་མི་ནུབ་པར་འགྲོ་བ་དང་དགུག་པ་དང་། རྣམ་པར་དབྱེ་བ་དང་དབང་དུ་བྱེད་པ་དང་། །དྲི་ཐམས་ཅད་དང་ཕྲེང་བ་དང་། མར་མེ་དག་ཀྱང་
en: Mañjuśrī, the divine youth, then pronounced the heart mantra of Yamāntaka, the Lord of Wrath , a sole hero suitable for all activities. This mantra effects summoning, dismissing, pacifying, enriching, and assaulting. It bestows the ability to become invisible, travel through space, enter subterranean paradises, and walk with great speed. It can be used for the activities of bringing beings into one’s presence, sowing enmity among them or enthralling them, and obtaining all kinds of perfume, garlands, ointments, and lamps.

source: རང་གི་རྒྱུད་ཀྱི་སྔགས་ཀྱིས་སྦྱིན་པར་བྱེད་དེམདོར་ན་ཇི་ལྟ་ཇི་ལྟར་སྦྱར་བ་དེ་ལྟ་དེ་ལྟར་སྒྲུབ་པར་བྱེད་པ་ནི་ཡི་གེ་གསུམ་ཞེས་བྱ་བ།
en: Being the chief mantra in its own tradition, it can accomplish, in short, anything that it is employed for. It is called Three Syllables.

source: སྟོབས་ཆེན་པོ་དོན་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ།
en: It is a great hero that accomplishes all purposes;

source: ཁྲོ་བོའི་རྒྱལ་པོའི་སྔགས་སྨྲས་པ་དེ་གང་ཞེ་ན།
en: it is the Great Lord of Wrath himself. And what is it? {2.4}

source: ཨོྃ་ཨཱཿཧཱུྃ།
en: “ Oṁ āḥ hrūṃ !”

source: འདི་ནི་ཁྲོ་བོ་ཆེན་པོ་དེའི་སྙིང་པོ་སྟེ་ལས་ཐམས་ཅད་བྱེད་པ་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་སྔགས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་སེམས་དཔའ་ཆེན་པོ་འཇམ་པའི་དབྱངས་ཀྱིས་སྨྲས་ཏེ
en: This is the all-accomplishing heart mantra of the Great Lord of Wrath, prescribed by the great being Mañjughoṣa for all maṇḍalas and all types of mantra practice.

source: བགེགས་ཐམས་ཅད་འཇིགས་པར་བྱེད་པའོ། །
en: It will destroy all obstacles. {2.5}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལག་པ་གཡས་པ་བཏེག་སྟེ། ཁྲོ་བོའི་སྤྱི་བོར་གཞག་པ་བྱས་སོ། །
en: Mañjuśrī, the divine youth, then raised his right hand and, placing it next to the head of Lord of Wrath ,

source: འདི་སྐད་དུ་ཡང་སྨྲས་ཏེ།
en: said,

source: སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to all the buddhas!

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དགོངས་སུ་གསོལ། གང་སུ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་རྣམ་པར་གནས་ཤིང་མཐའ་ཡས་མུ་མེད་པའི་རྫུ་འཕྲུལ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དམ་ཚིག་ལ་ལྷག་པར་གནས་པར་གྱིས་ཤིག །
en: May the lord buddhas, established in the infinite world spheres throughout the ten directions, pay heed! May the bodhisattvas with great magical powers, present throughout the limitless universe, empower this pledge!” {2.6}

source: དེ་སྐད་ཅེས་སྨྲས་ནསཁྲོ་བོའི་རྒྱལ་པོ་ལ་ལག་པ་བསྐོར་ནས་བཏང་བར་གྱུར་ཏོ། །
en: Having said this, he turned the Lord of Wrath around and dispatched him.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ཆེན་པོ་བཏང་མ་ཐག་ཏུ་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཏུ་སོང་ནས།
en: As soon as he was dispatched, the Great Lord of Wrath went to every world sphere and,

source: སྐད་ཅིག་ཙམ་གྱིས་གང་དག་སྡང་བའི་བསམ་པ་དང་ལྡན་པའི་སེམས་ཅན་རྫུ་འཕྲུལ་ཆེ་བ་དག་ཚར་བཅད་ཅིང་དེར་བཀུག་པར་གྱུར་ནས།
en: in an instant, subjugated all ill-willed beings possessed of great magical powers and

source: འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་གནས་གཙང་མའི་གཞལ་མེད་ཁང་དེར་ཡང་དག་པར་བཅུག་སྟེ།
en: brought them into the great assembly in the realm of the Pure Abode.

source: གནས་ཇི་ལྟ་བ་བཞིན་དུ་གནས་པར་བྱས་ནས་སེམས་ཅན་མ་རུངས་པ་དག་ལ་ཡང་ཀུན་ནས་འབར་བའི་ཕྲེང་བའི་ཚོགས་སུ་བྱས་ཤིང་།
en: Having thus established them there, he assumed a form surrounded by a blaze of light and

source: སྤྱི་བོ་ལ་ཡང་དག་པར་གནས་པར་བྱས་སོ། །
en: placed himself atop the heads of the evil beings. {2.7}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ལ་ཡང་བལྟས་ནས།
en: Then Mañjuśrī, the divine youth, looking at the gathering, said,

source: སེམས་ཅན་ཁྱེད་ཅག་ཐམས་ཅད་ཉོན་ཅིག །
en: “Please listen, all you respectable beings!

source: གང་ཡང་དམ་ཚིག་འདི་ལས་འདས་པར་གྱུར་ན་དེ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་འདིས་ཆད་པ་གཅོད་པར་འགྱུར་ཏེ་གང་
en: Anyone who would transgress my samaya will here be brought into submission by the Lord of Wrath .

source: སྔགས་ཀྱི་དོན་གྱི་ཚིག་གསང་བ་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མདོར་བསྟན་པ་བརྗོད་པར་བྱ་ཡིས།
en: For that reason the words of the lord buddhas and the bodhisattvas who possess great magical powers—the words that convey the meaning of the samaya pledges and the secret mantra—should not be disobeyed.

source: དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་པར་བྱའོ། །
en: Please listen well and keep in your minds what I will tell you. {2.8}

source: ན་མཿསརྦ་བུད་དྷཱ་ནཱཾ།
en: “Homage to all the buddhas!

source: ཨྃ་ར་ར་སྨྲ་ར་ཨ་པྲ་ཏི་ཧ་ཏ་ཤཱ་ས་ན། ཀུ་མཱ་ར་རཱུ་པ་དྷཱ་རི་ཎེ་ཧཱུྃ་ཧཱུྃ་ཕཊ་སྭཱ་ཧཱ།
en: “ Oṁ, ra ra ! Do remember! O perfect teacher possessing the form of a divine youth! Hūṁ hūṁ! Phaṭ phaṭ! Svāhā! {2.9}

source: གྲོགས་པོ་དག་འདི་ནི་རྩ་བའི་སྔགས་ཡིན་ཏེ་འཕགས་པ་འཇམ་དཔལ་ཞེས་བྱ་བ་ཡིན་ནོ། །
en: “This, friends, is my root mantra. It is called Noble Mañjuśrī.

source: ཕྱག་རྒྱ་ནི་གཙུག་ཕུད་ལྔ་པ་ཞེས་གྲགས་ཏེ་དེ་ལ་རབ་ཏུ་སྦྱར་བར་བྱའོ། །
en: The mudrā that should be employed with this root mantra is the so-called great five-crested mudrā. {2.10}

source: སྙིང་པོའི་སྔགས་འདི་ནི་ལས་ཐམས་ཅད་བྱེད་ཅིང་ཤེས་པ་ཡིན་ཏེ།
en: “Next is the all-accomplishing heart mantra. I will now pronounce this auspicious mantra that is suitable for all actions:

source: ཨོཾ་བཱ་ཀྱེ་དཾ་ན་མཿ།
en: “ Oṁ , this [mantra] is [my] homage to speech! {2.11}

source: འདིར་ཕྱག་རྒྱར་འགྱུར་བ་ནི་གཙུག་ཕུད་གསུམ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: “The mudrā that belongs with this mantra is the one called three-crested .
